DataMining/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-11 lun 15:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Doe" />
<link rel="stylesheet" href="tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0152779">1. What is Data Mining?</a></li>
<li><a href="#orgd42c136">2. Knowledge Discovering from Data (KDD)</a></li>
<li><a href="#org0da2530">3. Data mining origins</a></li>
<li><a href="#org6fd6ee7">4. Analysis techiques</a>
<ul>
<li><a href="#org822f01b">4.1. Descriptive methods</a></li>
<li><a href="#org523ecac">4.2. Predictive methods</a></li>
</ul>
</li>
<li><a href="#orgcb5158c">5. Classification</a>
<ul>
<li><a href="#orgfd77c19">5.1. Objectives</a></li>
<li><a href="#org127c0cb">5.2. Approaches</a></li>
<li><a href="#org5324586">5.3. Requirements</a></li>
<li><a href="#orgd1d0998">5.4. Applications</a></li>
</ul>
</li>
<li><a href="#orge519a8e">6. Clustering</a>
<ul>
<li><a href="#org08371a9">6.1. Objectives</a></li>
<li><a href="#org47485be">6.2. Approaches</a></li>
<li><a href="#org560b65c">6.3. Requirements</a></li>
</ul>
</li>
<li><a href="#org8f9f6e9">7. Association rules</a></li>
</ul>
</div>
</div>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-01-11 lun&gt;</span></span>
</p>

<div id="outline-container-org0152779" class="outline-2">
<h2 id="org0152779"><span class="section-number-2">1</span> What is Data Mining?</h2>
<div class="outline-text-2" id="text-1">
<p>
We want to extract hidden data from huge dataset that would be impossible to analyze &ldquo;by hand&rdquo;. We use algorithm that have been designed to perform such operations
</p>
</div>
</div>

<div id="outline-container-orgd42c136" class="outline-2">
<h2 id="orgd42c136"><span class="section-number-2">2</span> Knowledge Discovering from Data (KDD)</h2>
<div class="outline-text-2" id="text-2">
<p>
The fist step is to ask to a domain expert to select the data (<b>selection</b>), than we need to preprocees the data to remove error and clean it for the data mining (<b>preprocessing</b>). Next step is to transform the data in a common format to be analyzed(<b>trasnformation</b>). Finally we can perform the data minin to extract possible recurring pattern. After that we need the last step and use domain experts to extract the knowledge from actually understand what these patterns mean.
</p>
</div>
</div>

<div id="outline-container-org0da2530" class="outline-2">
<h2 id="org0da2530"><span class="section-number-2">3</span> Data mining origins</h2>
<div class="outline-text-2" id="text-3">
<p>
Draws from statistics and artificial intelligience, pattern recognition and machine learning, database systems. traditiona approach are not appropriates because of:
</p>
<ul class="org-ul">
<li>Significant data volume</li>
<li>Large data dimensionality</li>
<li>heterogeneous and distributed data</li>
</ul>
</div>
</div>
<div id="outline-container-org6fd6ee7" class="outline-2">
<h2 id="org6fd6ee7"><span class="section-number-2">4</span> Analysis techiques</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org822f01b" class="outline-3">
<h3 id="org822f01b"><span class="section-number-3">4.1</span> Descriptive methods</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Extract interpretable model describing the data
</p>
</div>
</div>
<div id="outline-container-org523ecac" class="outline-3">
<h3 id="org523ecac"><span class="section-number-3">4.2</span> Predictive methods</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Exploit know variable to predict unknowns ones
</p>
</div>
</div>
</div>
<div id="outline-container-orgcb5158c" class="outline-2">
<h2 id="orgcb5158c"><span class="section-number-2">5</span> Classification</h2>
<div class="outline-text-2" id="text-5">
<p>
Classification can be only use to predict situation that already happened in the past as it learns from data
</p>
</div>
<div id="outline-container-orgfd77c19" class="outline-3">
<h3 id="orgfd77c19"><span class="section-number-3">5.1</span> Objectives</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Prediction of a class label</li>
<li>Definition of and intepretable model of a given phenomenon</li>
</ul>
</div>
</div>
<div id="outline-container-org127c0cb" class="outline-3">
<h3 id="org127c0cb"><span class="section-number-3">5.2</span> Approaches</h3>
<div class="outline-text-3" id="text-5-2">
<p>
There are different approaches that can be used from simplest ones to nn and SVM
</p>
</div>
</div>
<div id="outline-container-org5324586" class="outline-3">
<h3 id="org5324586"><span class="section-number-3">5.3</span> Requirements</h3>
<div class="outline-text-3" id="text-5-3">
<p>
The requirements can be accuracy, intepretability, scalability, noise and outlier management. The requirements help us to chose which is the best algorithm to use.
</p>
</div>
</div>
<div id="outline-container-orgd1d0998" class="outline-3">
<h3 id="orgd1d0998"><span class="section-number-3">5.4</span> Applications</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Thera are myultiuple possible application that can use classification to reach different objectives
</p>
</div>
</div>
</div>
<div id="outline-container-orge519a8e" class="outline-2">
<h2 id="orge519a8e"><span class="section-number-2">6</span> Clustering</h2>
<div class="outline-text-2" id="text-6">
<p>
Used to describe datasets. This approach is usually quite computational expensive
</p>
</div>
<div id="outline-container-org08371a9" class="outline-3">
<h3 id="org08371a9"><span class="section-number-3">6.1</span> Objectives</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>detect group of similar objects</li>
<li>identify exceptions and outliers</li>
</ul>
</div>
</div>
<div id="outline-container-org47485be" class="outline-3">
<h3 id="org47485be"><span class="section-number-3">6.2</span> Approaches</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>partitional</li>
<li>hierachical</li>
<li>density based</li>
<li>SOM</li>
</ul>
</div>
</div>
<div id="outline-container-org560b65c" class="outline-3">
<h3 id="org560b65c"><span class="section-number-3">6.3</span> Requirements</h3>
<div class="outline-text-3" id="text-6-3">
<p>
In general they&rsquo;re not a lot scalable, their main deifferences are for the management of noise and outliers and hte management of large dimensionalities. A big concers inb intepretability as sometimes can be quite complex to immediatly understand the results. Indeed usalually a classification algorithm is used to help the intepretation
</p>
</div>
</div>
</div>
<div id="outline-container-org8f9f6e9" class="outline-2">
<h2 id="org8f9f6e9"><span class="section-number-2">7</span> Association rules</h2>
<div class="outline-text-2" id="text-7">
<p>
Used to exctract frequent correlations or patter from a transactional database
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Doe</p>
<p class="date">Created: 2021-01-11 lun 15:56</p>
</div>
</body>
</html>
